mentatpsi/Microchip/Graphics/External Memory/Configs/HWP_MEB_PIC32_ETH_SK_16PMP.h
#if defined (USE_TOUCHSCREEN_RESISTIVE)

	/*********************************************************************
	* Resistive Touch Screen A/D and I/O Specific Macros 
	*********************************************************************/
	// ADC Input Channel Selector
	#if defined(__dsPIC33F__) || defined(__PIC24H__) || defined(__dsPIC33E__) || defined(__PIC24E__)
		#define TOUCH_ADC_INPUT_SEL   AD1CHS0
    #else // all other supported devices
		#define TOUCH_ADC_INPUT_SEL   AD1CHS
    #endif

	// ADC Sample Start 
	#define TOUCH_ADC_START   AD1CON1bits.SAMP 

	// ADC Status
	#define TOUCH_ADC_DONE   AD1CON1bits.DONE

	// Hardware Platform dependend macros
	/* ----------------------------------------- */
	#if defined (PIC24FJ256DA210_DEV_BOARD)
	/* ----------------------------------------- */
		// ADC channel constants
		// Potentiometer and Temperature sensor
		/* PIC24FJ256DA210 Development Board does 
		 * not have a temperature sensor 
		 */
		#define ADC_POT			5
		#define ADC_XPOS		16
		#define ADC_YPOS		18

		// ADC Port Control Bits
		#define ADC_POT_PCFG	ANSBbits.ANSB5
		#define ADPCFG_XPOS		ANSCbits.ANSC4
		#define ADPCFG_YPOS		ANSGbits.ANSG7
        #define RESISTIVETOUCH_ANALOG  1
        #define RESISTIVETOUCH_DIGITAL 0

		// X port definitions
        #define ResistiveTouchScreen_XPlus_Drive_High()         LATCbits.LATC4   = 1
        #define ResistiveTouchScreen_XPlus_Drive_Low()          LATCbits.LATC4   = 0
        #define ResistiveTouchScreen_XPlus_Config_As_Input()    TRISCbits.TRISC4 = 1
        #define ResistiveTouchScreen_XPlus_Config_As_Output()   TRISCbits.TRISC4 = 0
		
        #define ResistiveTouchScreen_XMinus_Drive_High()        LATAbits.LATA2   = 1   
        #define ResistiveTouchScreen_XMinus_Drive_Low()         LATAbits.LATA2   = 0
        #define ResistiveTouchScreen_XMinus_Config_As_Input()   TRISAbits.TRISA2 = 1  
        #define ResistiveTouchScreen_XMinus_Config_As_Output()  TRISAbits.TRISA2 = 0
		
	     
		// Y port definitions
        #define ResistiveTouchScreen_YPlus_Drive_High()         LATGbits.LATG7   = 1
        #define ResistiveTouchScreen_YPlus_Drive_Low()          LATGbits.LATG7   = 0
        #define ResistiveTouchScreen_YPlus_Config_As_Input()    TRISGbits.TRISG7 = 1
        #define ResistiveTouchScreen_YPlus_Config_As_Output()   TRISGbits.TRISG7 = 0
		
        #define ResistiveTouchScreen_YMinus_Drive_High()        LATAbits.LATA1   = 1   
        #define ResistiveTouchScreen_YMinus_Drive_Low()         LATAbits.LATA1   = 0
        #define ResistiveTouchScreen_YMinus_Config_As_Input()   TRISAbits.TRISA1 = 1  
        #define ResistiveTouchScreen_YMinus_Config_As_Output()  TRISAbits.TRISA1 = 0
		
    
    // end of #if defined (PIC24FJ256DA210_DEV_BOARD)...
    
	/* ----------------------------------------- */
	#elif defined (MEB_BOARD)
	/* ----------------------------------------- */
	
		// ADC channel constants
		// Potentiometer and Temperature sensor
		/* The Multi-Media Expansion Board does not have a
		 * analog pot or temperature sensor (see BMA150 for temperature
		 * sensor data
		 */
		#if defined(__dsPIC33E__) || defined(__PIC24E__)
		
			#define ADC_XPOS    11
			#define ADC_YPOS    14
		
			// X port definitions
            #define ResistiveTouchScreen_XPlus_Drive_High()         LATBbits.LATB11   = 1
            #define ResistiveTouchScreen_XPlus_Drive_Low()          LATBbits.LATB11   = 0
            #define ResistiveTouchScreen_XPlus_Config_As_Input()    TRISBbits.TRISB11 = 1
            #define ResistiveTouchScreen_XPlus_Config_As_Output()   TRISBbits.TRISB11 = 0
			
            #define ResistiveTouchScreen_XMinus_Drive_High()        LATBbits.LATB13   = 1   
            #define ResistiveTouchScreen_XMinus_Drive_Low()         LATBbits.LATB13   = 0
            #define ResistiveTouchScreen_XMinus_Config_As_Input()   {ANSELBbits.ANSB13 = ANSEL_ANALOG; TRISBbits.TRISB13 = 1;}  
            #define ResistiveTouchScreen_XMinus_Config_As_Output()  {ANSELBbits.ANSB13 = ANSEL_ANALOG; TRISBbits.TRISB13 = 0;}

			// Y port definitions
            #define ResistiveTouchScreen_YPlus_Drive_High()         LATBbits.LATB14   = 1
            #define ResistiveTouchScreen_YPlus_Drive_Low()          LATBbits.LATB14   = 0
            #define ResistiveTouchScreen_YPlus_Config_As_Input()    TRISBbits.TRISB14 = 1
            #define ResistiveTouchScreen_YPlus_Config_As_Output()   TRISBbits.TRISB14 = 0
			
            #define ResistiveTouchScreen_YMinus_Drive_High()        LATBbits.LATB12   = 1   
            #define ResistiveTouchScreen_YMinus_Drive_Low()         LATBbits.LATB12   = 0
            #define ResistiveTouchScreen_YMinus_Config_As_Input()   {ANSELBbits.ANSB12 = ANSEL_ANALOG; TRISBbits.TRISB12 = 1;}  
            #define ResistiveTouchScreen_YMinus_Config_As_Output()  {ANSELBbits.ANSB12 = ANSEL_ANALOG; TRISBbits.TRISB12 = 0;}	
		
		#else
		
			#define ADC_XPOS    ADC_CH0_POS_SAMPLEA_AN11
			#define ADC_YPOS    ADC_CH0_POS_SAMPLEA_AN14
	
			// ADC Port Control Bits
			#define ADPCFG_XPOS AD1PCFGbits.PCFG11
			#define ADPCFG_YPOS AD1PCFGbits.PCFG14
	        #define RESISTIVETOUCH_ANALOG  0
            #define RESISTIVETOUCH_DIGITAL 1

			// X port definitions
            #define ResistiveTouchScreen_XPlus_Drive_High()         LATBbits.LATB11   = 1
            #define ResistiveTouchScreen_XPlus_Drive_Low()          LATBbits.LATB11   = 0
            #define ResistiveTouchScreen_XPlus_Config_As_Input()    TRISBbits.TRISB11 = 1
            #define ResistiveTouchScreen_XPlus_Config_As_Output()   TRISBbits.TRISB11 = 0
			
            #define ResistiveTouchScreen_XMinus_Drive_High()        LATBbits.LATB13   = 1   
            #define ResistiveTouchScreen_XMinus_Drive_Low()         LATBbits.LATB13   = 0
            #define ResistiveTouchScreen_XMinus_Config_As_Input()   {AD1PCFGbits.PCFG13 = 1; TRISBbits.TRISB13 = 1;}  
            #define ResistiveTouchScreen_XMinus_Config_As_Output()  {AD1PCFGbits.PCFG13 = 1; TRISBbits.TRISB13 = 0;}

			// Y port definitions
            #define ResistiveTouchScreen_YPlus_Drive_High()         LATBbits.LATB14   = 1
            #define ResistiveTouchScreen_YPlus_Drive_Low()          LATBbits.LATB14   = 0
            #define ResistiveTouchScreen_YPlus_Config_As_Input()    TRISBbits.TRISB14 = 1
            #define ResistiveTouchScreen_YPlus_Config_As_Output()   TRISBbits.TRISB14 = 0
			
